driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSCustomEncoderTest_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jms="http://j2ee.netbeans.org/wsdl/jmsbcEncoderTest/JMSBCCustomEncoderTest">
  <soapenv:Body>
    <jms:JMSBCCustomEncoderTestOperation>
      <corrId>JMSCustomEncoderTestCorrID:12345</corrId>
      <encodedPayload><root xmlns="http://xml.netbeans.org/schema/jmsbcEncoderTest/CustomEncoderTest" xsi:schemaLocation="http://xml.netbeans.org/schema/jmsbcEncoderTest/CustomEncoderTest @SRCROOT@Projects/EncoderTestBpel/src/CustomEncoderTest.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><groupnode><element1><delimfield1>a</delimfield1><delimfield2>b</delimfield2></element1><element2><fixedfield1>1111111111</fixedfield1><fixedfield2>22222222222222222222</fixedfield2></element2></groupnode></root></encodedPayload>
    </jms:JMSBCCustomEncoderTestOperation>
  </soapenv:Body>
</soapenv:Envelope>
